""" Найдите сумму цифр трехзначного числа n.
Результат сохраните в перменную res.

Пример:
n = 123 -> res = 6 (1 + 2 + 3)
n = 100 -> res = 1 (1 + 0 + 0) 
"""

n = 123
suma = 0
while n > 0:
    suma += n%10
    n = n//10

res = suma
print(res)